InProgress/MultiElementAirfoil/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        nFaces          117052;
        startFace       87052;
    }
    tunnel
    {
        type            wall;
        physicalType    wall;
        nFaces          40;
        startFace       204104;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       204144;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       204164;
    }
    wing
    {
        type            wall;
        physicalType    wall;
        nFaces          1394;
        startFace       204184;
    }
)

// ************************************************************************* //
