InProgress/MultiElementAirfoil/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Revision: exported                              |
|    \\/     M anipulation  | Web:      http://www.OpenFOAM.org               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (18 0 0);

boundaryField
{
    wing
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type fixedValue;
        value $internalField;
    }
    outlet
    {
        type inletOutlet;
        inletValue uniform (0 0 0);
        value $internalField;
    }
    tunnel
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
frontAndBack { type empty; }
}


// ************************************************************************* //
